# YOLOv8 with EfficientNet Backbone

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  m: [0.67, 0.75, 768]  # YOLOv8m summary

# EfficientNet Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, EfficientNet, ['efficientnet_b0', 3]]  # EfficientNet B0 as backbone
  - [-1, 1, Conv, [256, 1, 1]]  # Adjust channels after EfficientNet

# YOLOv8 Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # Concatenate with P4 from EfficientNet
  - [-1, 3, C2f, [512]]  # Custom head layer

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # Concatenate with P3 from EfficientNet
  - [-1, 3, C2f, [256]]  # Custom head layer (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # Concatenate with P4 from YOLOv8
  - [-1, 3, C2fCIB, [512, True]]  # Custom head layer (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # Concatenate with P5 from YOLOv8
  - [-1, 3, C2fCIB, [1024, True]]  # Custom head layer (P5/32-large)

  - [[16, 19, 22], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)
