nc: 80  # number of classes
scales:  # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  b: [0.67, 1.00, 512] 

# YOLOv10 backbone with EfficientNet
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]]  # Initial Conv layer
  - [-1, 1, EfficientNetBlock, [32, 16, 1, 1, 1]]  # Stage 1
  - [-1, 2, EfficientNetBlock, [16, 24, 2, 6, 2]]  # Stage 2
  - [-1, 2, EfficientNetBlock, [24, 40, 2, 6, 2]]  # Stage 3
  - [-1, 3, EfficientNetBlock, [40, 80, 2, 6, 3]]  # Stage 4
  - [-1, 3, EfficientNetBlock, [80, 112, 1, 6, 3]]  # Stage 5
  - [-1, 4, EfficientNetBlock, [112, 192, 2, 6, 4]]  # Stage 6
  - [-1, 1, EfficientNetBlock, [192, 320, 1, 6, 1]]  # Stage 7
  - [-1, 1, Conv, [1024, 1, 1]]  # Final Conv layer
  - [-1, 1, SPPF, [1024, 5]]  # SPPF layer
  - [-1, 1, PSA, [1024]]  # PSA layer

# YOLOv10 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2fCIB, [512, True]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2fCIB, [512, True]]  # 19 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2fCIB, [1024, True]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, v10Detect, [nc]]